<template>
  <main id="Policy-Fld">
    <section id="Policy-Section">
      <div class="Policy-Ground-Work">
        <div class="Header-Area">
          <div class="Close-Back-Btn" @click="Close">戻る</div>
          <div class="Policy-Header-Fld">
            <div class="Policy-Header-Text">プライバシーポリシー</div>
          </div>
          <div class="Under-Line"></div>
        </div>
        <div class="PolicyText">
          株式会社カラット(以下「当社」といいます)が運営する「アナザーヒロイン～ヒロインデイズ～」(以下「本サービス」といいます)におけるプライバシー情報の取扱いについて、以下のとおりプライバシーポリシー(以下「本ポリシー」といいます)を定めます。<br>
          <br>
          第1条(プライバシー情報)<br>
          <br>
          ・プライバシー情報のうち「個人情報」とは、個人情報保護法にいう「個人情報」を指すものとし、生存する個人に関する情報であって、当該情報に含まれる氏名、生年月日、住所、電話番号、連絡先その他の記述等により特定の個人を識別できる情報を指します。<br>
          ・プライバシー情報のうち「履歴情報および特性情報」とは、上記に定める「個人情報」以外のものをいい、ご利用いただいたサービス、ご利用日時、ご利用の方法、ご利用環境、郵便番号や性別、職業、年齢、ユーザーのIPアドレス、端末の個体識別情報などを指します。<br>
          <br>
          第２条(プライバシー情報の収集方法)<br>
          <br>
          ・当社は、ユーザーが利用登録をする際に氏名、生年月日などの個人情報をお尋ねすることがあります。また、ユーザーと提携先などとの間でなされたユーザーの個人情報を含む取引記録や、決済に関する情報を当社の提携先(情報提供元、広告配信先などを含みます。以下｢提携先｣といいます)などから収集することがあります。<br>
          ・当社は、ユーザーについて、利用したサービス、利用日時、利用方法、利用環境(携帯端末の通信状態、利用に際しての各種設定情報なども含みます)、IPアドレス、端末の個体識別情報などの履歴情報および特性情報を、ユーザーが当社や提携先のサービスを利用する際に収集します。<br>
          <br>
          第３条(個人情報を収集・利用する目的)<br>
          <br>
          ・当社が個人情報を収集・利用する目的は、以下のとおりです。<br>
          　１.本サービスを提供する目的<br>
          　２.ユーザーに自分の利用状況の閲覧を行っていただくために、利用されたサービスなどに関する情報を表示する目的<br>
          　３.ユーザーの本人確認を行うために、氏名、生年月日、住所、電話番号、配達証明付き郵便の到達結果などの情報を利用する目的<br>
          　４.ユーザーが簡便にデータを入力できるようにするために、当社に登録されている情報を入力画面に表示させたり、ユーザーのご指示に基づいて他のサービスなど(提携先が提供するものも含みます)に転送したりする目的<br>
          　５.第三者に損害を発生させたりするなど、本サービスの利用規約に違反したユーザーや、不正・不当な目的でサービスを利用しようとするユーザーの利用をお断りするために、利用態様、氏名や住所など個人を特定するための情報を利用する目的<br>
          　６.ユーザーからのお問い合わせに対応するために、お問い合わせ内容に関する情報など当社がユーザーに対してサービスを提供するにあたって必要となる情報や、ユーザーのサービス利用状況、連絡先情報などを利用する目的<br>
          　７.本サービスに関して当社から物品等を配送する目的<br>
          　８.上記の利用目的に付随する目的<br>
          <br>
          第４条(個人情報の第三者提供)<br>
          ・当社は、次に掲げる場合を除いて、あらかじめユーザーの同意を得ることなく、第三者に個人情報を提供することはありません。ただし、個人情報保護法その他の法令で認められる場合を除きます。<br>
          　１.法令に基づく場合<br>
          　２.人の生命、身体または財産の保護のために必要がある場合であって、本人の同意を得ることが困難であるとき<br>
          　３.公衆衛生の向上または児童の健全な育成の推進のために特に必要がある場合であって、本人の同意を得ることが困難であるとき<br>
          　４.国の機関もしくは地方公共団体またはその委託を受けた者が法令の定める事務を遂行することに対して協力する必要がある場合であって、本人の同意を得ることにより当該事務の遂行に支障を及ぼすおそれがあるとき<br>
          　５.予め次の事項を告知あるいは公表をしている場合<br>
          　　　（１）利用目的に第三者への提供を含むこと<br>
          　　　（２）第三者に提供されるデータの項目<br>
          　　　（３）第三者への提供の手段または方法<br>
          　　　（４）本人の求めに応じて個人情報の第三者への提供を停止すること<br>
          <br>
          ・前項の定めにかかわらず、次に掲げる場合は第三者には該当しないものとします。<br>
          　１.当社が利用目的の達成に必要な範囲内において個人情報の取扱いの全部または一部を委託する場合<br>
          　２.合併その他の事由による事業の承継に伴って個人情報が提供される場合<br>
          　３.個人情報を特定の者との間で共同して利用する場合であって、その旨並びに共同して利用される個人情報の項目、共同して利用する者の範囲、利用する者の利用目的および当該個人情報の管理について責任を有する者の氏名または名称について、あらかじめ本人に通知し、または本人が容易に知り得る状態に置いているとき<br>
          <br>
          第５条(個人情報の開示)<br>
          <br>
          当社は、本人から個人情報の開示を求められたときは、本人に対し、遅滞なくこれを開示します。ただし、開示することにより次のいずれかに該当する場合は、その全部または一部を開示しないこともあり、開示しない決定をした場合には、その旨を遅滞なく通知します。なお、個人情報の開示に際しては、1件あたり1,000円の手数料を申し受けます。<br>
          <br>
          　１.本人または第三者の生命、身体、財産その他の権利利益を害するおそれがある場合<br>
          　２.当社の業務の適正な実施に著しい支障を及ぼすおそれがある場合<br>
          　３.その他法令に違反することとなる場合<br>
          <br>
          ・前項の定めにかかわらず、履歴情報および特性情報などの個人情報以外の情報については、原則として開示いたしません。<br>
          <br>
          第６条(個人情報の訂正および削除)<br>
          <br>
          ・ユーザーは、当社の保有する自己の個人情報が誤った情報である場合には、当社が定める手続きにより、当社に対して個人情報の訂正または削除を請求することができます。<br>
          ・当社は、ユーザーから前項の請求を受けてその請求に応じる必要があると判断した場合には、遅滞なく、当該個人情報の訂正または削除を行い、これをユーザーに通知します。<br>
          <br>
          第７条(個人情報の利用停止等)<br>
          <br>
          ・当社は、本人から、個人情報が、利用目的の範囲を超えて取り扱われているという理由、または不正の手段により取得されたものであるという理由、その他個人情報保護法その他関係法令に定められた理由により、その利用の停止または消去(以下「利用停止等」といいます)を求められた場合には、遅滞なく必要な調査を行い、その結果に基づき、個人情報の利用停止等を行い、その旨本人に通知します。ただし、個人情報の利用停止等に多額の費用を有する場合その他利用停止等を行うことが困難な場合であって、本人の権利利益を保護するために必要なこれに代わるべき措置をとれる場合は、この代替策を講じます。<br>
          <br>
          第８条（苦情等の申し出先）<br>
          <br>
          ・個人情報に関する開示、訂正及び削除、利用停止等、苦情その他のご連絡については、以下の窓口までご連絡ください。<br>
          株式会社カラット　個人情報担当窓口<br>
          メールアドレス：support@123chat.jp<br>
          第９条(プライバシーポリシーの変更)<br>
          ・本ポリシーの内容は、ユーザーに通知することなく、変更することができるものとします。<br>
          ・当社が別途定める場合を除いて、変更後のプライバシーポリシーは、本サービス内に掲載したときから効力を生じるものとします。<br>
          <br>
          ───────────────<br>
          運営会社：株式会社カラット<br>
          https://k-arat.co.jp<br>
        </div>
      </div>
    </section>
  </main>
</template>

<script lang="ts">
import { defineComponent, onMounted } from 'vue';

export default defineComponent({
  name: 'Policy',
  components: {
  },
  
  data: function(){
    return{
    }
  },

  methods: {
    Close: function(){
      this.$emit("onClick", false);
    }
  },

  mounted(){
    const setFillHeight = () => {
        const vh = window.innerHeight * 0.01;
        document.documentElement.style.setProperty('--vh', `${vh}px`);
    }

    // 画面のサイズ変動があった時に高さを再計算する
    window.addEventListener('resize', setFillHeight);

    // 初期化
    setFillHeight();
  }
});
</script>

<style scoped lang="scss">

#Policy-Fld{
  position: fixed;
  bottom: 0;
  background-color: rgba(255,255,255,0.9);
  overflow-x: hidden;
  width: 90%;
  height: calc(var(--vh, 1vh) * 99);
}

#PolicySection{
  overflow: scroll;
  width: 100%;
  height: 100%;
  border-radius: 15px;
}

.Policy-Ground-Work{
}

.Header-Area{
  position: sticky;
  top: 0;
  width: 100%;
}

.Close-Back-Btn{
  font-size: 10pt;
  position: absolute;
  background-color: #FFFFFF;
  color: #000000;
  padding: 0px 15px;
  display: block;
  border: 1px solid rgba(0, 0, 0, 0.5);
  border-radius: 25px;
  top: 16px;
  left: 16px;
  z-index: 1;
}

.Policy-Header-Fld{
  border-radius: 15px 15px 0 0;
  background-image: url("../assets/another/notionheader.png");
  background-repeat: no-repeat;
  background-size: cover;
  display: flex;
  flex-flow: column;
}

.Under-Line{
  background-color: rgba(255,255,255,0.9);
  height: 15px;
  width: 100%;
}

.Policy-Header-Text{
  padding: 25px;
  padding-top: 15px;
  margin-left: 10px;
  font-weight: bold;
  font-size: 15px;
  color: #FFFFFF;
}

.PolicyText{
  font-size: 12pt;
  padding: 0 8px;
  display: flex;
  flex-flow: column;
  text-align: left;
}

@media (min-width: 500px) {
  #section1{
    height: calc(var(--vh, 1vh) * 100);
    overflow: hidden;
    background-color: #000;
  }
}

</style>