<template>
  <input type="text" v-model="newTopic">
  {{newTopic}}
  <button v-on:click="addTopic">add</button>
  

  <ul>
    <li v-bind:class="{active : tabindex=='tab1'}"><label ><input type="radio" value="tab1" v-model="tabindex">tab1</label></li>
    <li v-bind:class="{active : tabindex=='tab2'}"><label ><input type="radio" value="tab2" v-model="tabindex">tab2</label></li>
    <li v-bind:class="{active : tabindex=='tab3'}"><label ><input type="radio" value="tab3" v-model="tabindex">tab3</label></li>
    <li v-bind:class="{active : tabindex=='tab4'}"><label ><input type="radio" value="tab4" v-model="tabindex">tab4</label></li>
  </ul>
  
  <template v-if="selectedTopic !== null">
    {{selectedTopic}}
  </template> 
  <template v-else>
    お題が選択されていません
  </template> 

  <template v-if="tabindex=='tab4'">
    <ul>
      <li v-for="item , i in topics" v-bind:key="i"><button v-on:click="selectTopic(item)">{{item.name}}</button></li>
    </ul>
  </template>
</template>



<script lang="ts">
import { defineComponent } from 'vue';

export default defineComponent({
  name: 'TopicList',
  methods : {
    addTopic : function(){
      this.topics.push({name:this.newTopic})
    },
    selectTopic : function(topic:any){
      console.log(topic);
      this.selectedTopic = topic;
    }
  },
  data: function(){
    return {
      topics : [{name:"作者「この作品で伝えたいことは○○です」 何と言った？"},
                {name:"医者「吸って〜、吐いて〜、○○」 何と言った？"},
                {name:"足ツボ師「ここが痛い人は○○が○○」何と言った？"},
                {name:"「【速報】○○」"},
                {name:"「ここの角曲がると○○んだよなぁ」何と言った？"},
                {name:"「正解は○○でした〜！」何？"},
                {name:"「うーん、良い人なんだけどちょっとだけ○○だよね」何と言った？"},
                {name:"「もっちりとした生地に、○○」何？"},
                {name:"「お母さん、実は昔ね…○○」何と言われた？"},
                {name:"「お父さんも昔は○○」なんと言われた？"},
                {name:"「○○でつ！ｗ」何？"},
                {name:"「あ、じゃあ○○」何？"},
                {name:"「○○ならある！だから命だけは！」何？"},
                {name:"ハンバーガーショップの新商品、攻めたな〜！ どんな商品？"},
                {name:"最新スマホの発表会で大ひんしゅく！ なんで？"},
                {name:"新規参入の牛丼屋、キャッチコピーを教えてください"},
                {name:"新作ゲーム、値段はなんと50円！どんなゲーム？"},
                {name:"新作釣具のいらない機能とは？"},
                {name:"確実に売れない最新ゲームソフト、タイトルは？"},
                {name:"リフティングしながら一言"},
                {name:"将棋盤をひっくり返して一言"},
                {name:"試着室で一言"},
                {name:"キャッチボールをしながら一言"},
                {name:"送信ボタンを押しながら一言"},
                {name:"告白をする時の余計な一言"},
                {name:"プロテインをぶちまけて一言"},
                {name:"はしゃいでる子役を見て一言"},
                {name:"息を切らして一言"},
                {name:"耳元で一言"},
                {name:"「一応言っておくけど」に続けて一言"},
                {name:"踊りながら一言"},
                {name:"爆笑しながら一言"},
                {name:"パレード中に一言"},
                {name:"ハッとした顔で一言"},
                {name:"石の裏側を見て一言"},
                {name:"知恵の輪を引きちぎって一言"},
                {name:"犬の交尾を眺めながら一言"},
                {name:"大火事の現場で慌てながら一言"},
                {name:"心の炎を燃やして一言"},
                {name:"辺りを見渡して一言"},
                {name:"驚きながら一言"},
                {name:"ふてぶてしい男が居直って一言"},
                {name:"ふてぶてしい女が居直って一言"},
                {name:"ドヤ顔のオタクが一言"},
                {name:"猫に嫉妬した犬が一言"},
                {name:"おにぎりにキレてください"},
                {name:"哺乳瓶にキレてください"},
                {name:"シングルのトイレットペーパーにキレてください"},
                {name:"ウォシュレットにキレてください"},
                {name:"泣きながらキレてください"},
                {name:"ナスにキレてください"},
                {name:"スポンジにキレてください"},
                {name:"タライにキレてください"},
                {name:"ハンバーガーにキレてください"},
                {name:"シンバルにキレてください"},
                {name:"何でもいいから対義語を教えてください"},
                {name:"嘘でもいいから豆知識を教えてください"},
                {name:"あなたの周りに流れてる噂を教えてください"},
                {name:"人生の裏技を教えてください"},
                {name:"コンビニの裏技を教えてください"},
                {name:"何でもいいから類義語を教えてください"},
                {name:"日本の嘘ことわざを教えてください"},
                {name:"外国の嘘ことわざを教えてください"},
                {name:"嘘うんちくを教えてください"},
                {name:"あなたのラジオネームを教えてください"},
                {name:"一番どうでもいい「平成最後の〇〇」を教えてください"},
                {name:"茶道教室で先生に言われた衝撃の一言"},
                {name:"電車で隣のおじさんから言われた衝撃の一言"},
                {name:"市役所の生活安全課で言われた衝撃の一言"},
                {name:"ベテラン警察官に言われた衝撃の一言"},
                {name:"隣のトイレから聞こえた衝撃の一言"},
                {name:"最終面接で言われた衝撃の一言"},
                {name:"結婚式で神父に言われた衝撃の一言"},
                {name:"耳鼻科の先生に言われた衝撃の一言"},
                {name:"押し売りセールスマンから言われた衝撃の一言"},
                {name:"工事現場から聞こえた衝撃の一言"},
                {name:"契約書に書いてあった衝撃の一言"},
                {name:"コンビニ店員に言われた衝撃の一言"},
                {name:"町の変人に言われた衝撃の一言"},
                {name:"パチンコ台叩きおじさんに言われた衝撃の一言"},
                {name:"オタクに言われた衝撃の一言"},
                {name:"こんな標識は嫌だ"},
                {name:"こんな短冊は嫌だ"},
                {name:"こんな状況は嫌だ"},
                {name:"こんな説教は嫌だ"},
                {name:"こんな体操は嫌だ"},
                {name:"屁理屈カルタ「あ」"},
                {name:"ネガティブカルタ「ら」"},
                {name:"不快な俳句を教えてください"},
                {name:"上句は幸せなのに下句は不幸な短歌"},
                {name:"2秒後には忘れてる俳句"},
                {name:"万能な短歌の下句を教えてください"},
                {name:"嘘JK俳句"},
                {name:"デブ俳句"},
                {name:"ゲス短歌"},
                {name:"嘘短歌"},
                {name:"なんか気持ち悪い短歌"},
                {name:"思想が強い俳句"},
                {name:"サイコパスお母さんの朝のルーティンを教えてください"},
                {name:"サイコパスお父さんがする説教後のフォローとは？"},
                {name:"サイコパス教師が発した朝礼での一言"},
                {name:"動物園で友人をサイコパスだと疑った理由とは？"},
                {name:"サイコパス保育園の最大の特徴は？"},
                {name:"サイコパスすごろくのマスを教えてください"},
                {name:"サイコパスハッシュタグを教えてください"},
                {name:"マッチョ図鑑で一番人気なページ"},
                {name:"マッチョ村で村八分にされる人の特徴は？"},
                {name:"マッチョ国で決して犯してはいけない重罪とは？"},
                {name:"マッチョの弱点"},
                {name:"ゴリマッチョと細マッチョが対立！和解するには？"},
                {name:"ハイテンションなげやり掃除"},
                {name:"ハイテンションなげやり店員"},
                {name:"ハイテンションなげやり脱毛"},
                {name:"ハイテンションなげやり教育"},
                {name:"ハイテンションなげやり小説"},
                {name:"ハイテンションなげやり図鑑"},
                {name:"やりすぎ小学校のやりすぎ運動会、その特徴は？"},
                {name:"やりすぎ居酒屋、その特徴は？"},
                {name:"やりすぎママの衝撃的な行動とは？"},
                {name:"やりすぎパパの衝撃的なルーチンとは？"},
                {name:"やりすぎ大掃除で起きたハプニングを教えてください"},
                {name:"名言に一言足して必死な感じにしてください"},
                {name:"名言を子供っぽく言ってください"},
                {name:"ギャル名言"},
                {name:"ヒモ名言"},
                {name:"サイコパス名言"},
                {name:"幼稚園児最大の名言"},
                {name:"敵組織の最弱幹部っぽいことを言ってください"},
                {name:"モブっぽいことを言ってください"},
                {name:"ベテランっぽいことを言ってください"},
                {name:"新人っぽいことを言ってください"},
                {name:"世界滅亡の日っぽいことを言ってください"},
                {name:"キャッチアンドリリースっぽいことを言ってください"},
                {name:"詐欺師っぽいことを言ってください"},
                {name:"アーティストっぽいことを言ってください"},
                {name:"カリスマっぽいことを言ってください"},
                {name:"犬っぽいことを言ってください"},
                {name:"「自己破産」とは全然関係ない言葉を教えてください"},
                {name:"「お母さん」とは全然関係ない言葉を教えてください"},
                {name:"「タンポポ」とは全然関係ない言葉を教えてください"},
                {name:"「世界恐慌」とは全然関係ない言葉を教えてください"},
                {name:"「マフィア」とは全然関係ない言葉を教えてください"},
                {name:"「お名前だけでも教えてください！」に対して返答してください"},
                {name:"「力が欲しいか？」に対して返答してください"},
                {name:"「どうしてこんなことをしたんだ！！」に対して返答してください"},
                {name:"「もうバス出ちゃうよ！！」に対して返答してください"},
                {name:"「産まれる！」に対して返答してください"},
                {name:"「最期に言い残す事はあるか？」に対して返答してください"},
                {name:"「お前がやったんだろ！！」に対して返答してください"},
                {name:"自分を呼んでる親に対して反抗期風に返答してください"},
                {name:"「この鞄に金を詰めろ！」に対して返答してください"},
                {name:"「ここ、臭い…」原因は？"},
                {name:"隣のおじさんが妙に咳き込んでる！原因は？"},
                {name:"ソクラテスが処刑された本当の原因とは？"},
                {name:"町の公民館が大爆発！その原因は？"},
                {name:"国民がいつも笑顔の国で暴動が！原因は？"},
                {name:"コメディ映画の主演になった俳優の検索履歴とは？"},
                {name:"連続窃盗犯の検索履歴とは？"},
                {name:"サイコパスお母さんの検索履歴とは？"},
                {name:"パンダの検索履歴"},
                {name:"てるてる坊主の検索履歴"},
                {name:"クズ物園の目玉展示を教えてください"},
                {name:"クズで有名なお坊さんの説法"},
                {name:"クズ合コンの名物は？"},
                {name:"クズvsカス 何対決？"},
                {name:"クズなりに自己擁護をしてください"},
                {name:"陰キャ界最強の陽キャの特徴とは？"},
                {name:"陽キャ界一番の陰キャの特徴とは？"},
                {name:"「あ、こいつゴールキーパーだな」どんな特徴？"},
                {name:"「こいつさては裁判官だな」どんな特徴？"},
                {name:"「こいつ・・・パリピだ！！」どんな特徴？"},
                {name:"優しすぎお化け屋敷の特徴とは？"},
                {name:"後の祭りを現代風にしてください"},
                {name:"後は野となれ山となれを現代風にしてください"},
                {name:"石橋を叩いて渡るを現代風にしてください"},
                {name:"井の中の蛙大海を知らずを現代風にしてください"},
                {name:"鬼に金棒を現代風にしてください"},
                {name:"帯に短したすきに長しを現代風にしてください"},
                {name:"触らぬ神に祟りなしを現代風にしてください"},
                {name:"棚からぼた餅を現代風にしてください"},
                {name:"泣きっ面にハチを現代風にしてください"},
                {name:"ぬか床に釘を現代風にしてください"},
                {name:"身から出た錆を現代風にしてください"},
                {name:"壁に耳あり障子に目ありを現代風にしてください"},
                {name:"雀の涙を現代風にしてください"},
                {name:"弁慶の泣き所を現代風にしてください"},
                {name:"焼け石に水を現代風にしてください"},
                {name:"バケモノの声で普通のことを言ってください"},
                {name:"前向きにネガティブな発言をしてください"},
                {name:"「今日の自分、99点だったな」その理由は？"},
                {name:"今日のパパ、なんだかかっこいい！ なんで？"},
                {name:"「しつこい！！」と言わせてください"},
                {name:"急にダラけてください"},
                {name:"嫌な寝言"},
                {name:"お前、実は国王の子供だったんだってよ！"},
                {name:"ギリギリバレない悪口"},
                {name:"外国語っぽく怒ってください"},
                {name:"失敗を匂わせてください"},
                {name:"え、なんて？"},
                {name:"例え下手なキザのキメ台詞"},
                {name:"何らかの匂わせをしてください"},
                {name:"民度が悪いモノマネをしてください"},
                {name:"このババァ、素早い・・・！！！"},
                {name:"このジジィ、強すぎる・・・！！"},
                {name:"反抗的なことを言ってください"},
                {name:"丁寧にdisってください"},
                {name:"大金持ちにマウンティングをしてください"},
                {name:"「そんな時に出会ったのが、このクソ青汁でした」でオトしてください"},],
      newTopic :"",
      tabindex : "tab1",
      selectedTopic : null
    }
  }
});
</script>

<!-- Add "scoped" attribute to limit CSS to this component only -->
<style scoped lang="scss">

li.active {
  color:Red;
}

</style>
